flashsim_result/sysbench/ctoc_noshadow/nontrx_insert_t60.out
2018. 12. 19. (수) 23:16:40 KST
[SYSBENCH] Running benchmark...
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 16

Doing OLTP test.
Running non-transactional test
Using Uniform distribution
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 15 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            0
        write:                           4289490
        other:                           0
        total:                           4289490
    transactions:                        4289490 (71491.28 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 4289490 (71491.28 per sec.)
    other operations:                    0      (0.00 per sec.)

Test execution summary:
    total time:                          60.0002s
    total number of events:              4289490
    total time taken by event execution: 956.6315
    per-request statistics:
         min:                                  0.06ms
         avg:                                  0.22ms
         max:                                 85.05ms
         approx.  95 percentile:               0.37ms

Threads fairness:
    events (avg/stddev):           268093.1250/566.01
    execution time (avg/stddev):   59.7895/0.00

2018. 12. 19. (수) 23:17:42 KST

------------------------------------------------------------------------------

mutex_t : 0x1beb2ea8 q:0x1beb2ea0, size:2048
mutex_t : 0x1beb3478 q:0x1beb3470, size:1024
mutex_t : 0x1beb34d8 q:0x1beb34d0, size:1024
mutex_t : 0x1beb3538 q:0x1beb3530, size:1024
nohost: [dm_nohost_probe] PROBE STARTED
Initializing Connectal & DMA...
subprocess pid 11180 completed status=0 0
[initPortalHardwareOnce:270] fd 5 len 0
[checkSignature:167] read status from '/dev/connectal' was only 0 bytes long
checkSignature: driver 'zynqportal.c' signature mismatch 3431c6f01fcc1c478c8187d1e6992edc e059016ac411386d6e2597d43bc49e15
checkSignature: driver 'portalmem.c' signature mismatch 0ba7c77e370fade81cfa5a0e5abb92f0 eef0fb3bacb31283d694f7aef3d380b3
Main::allocating memory...
USE_ACP = FALSE
USE_ACP = FALSE
Main::allocating memory finished!
[dmaManagerOnce:44]
Requested FCLK[0]=200000000 actually 200000000
Requested Freq: 200.00, Actual Freq: 200.00, status=0
LOG: DEBUG DUMP: gearSend = 1674527202, gearRec = -1341660114, aurSend = -362896554, aurRec = -2120284827, readSend=-1945382842, writeSend=-1289201194
nohost: [dm_nohost_probe] PROBE DONE!
nohost: [dm_nohost_open] open done!
!!! print info !!!
Async status: 1
use wirte buffer: 1
Wait same mapping request(FLYING): 0
use gc polling: 0
use eviction polling: 0
# of total block: 512
# of total page: 8388608
page per block: 16384
# of translation block: 2
# of translation page: 32768
# of data block: 508
# of data page: 8323072
# of total cache mapping entry: 4096
max # of ram reside cme: 1024
max # of clean translation cache table: 512
cache percentage: 25.000%
!!! print info !!!
BM_Init() End!
mutex_t : 0x1bed3378 q:0x1bed3370, size:1024
mutex_t : 0x1bed9ef8 q:0x1bed9ef0, size:1024
mutex_t : 0x1bed9f58 q:0x1bed9f50, size:1024
_nos:512
bad_block_checking...[ 99.998474 ]
badblock_cnt: 90
_RNOS:4096
bad block 294912 -> 67092480
bad block 737280 -> 67076096
bad block 770048 -> 67059712
bad block 802816 -> 67043328
bad block 835584 -> 67026944
bad block 1474560 -> 67010560
bad block 1490944 -> 66994176
bad block 1884160 -> 66977792
bad block 2359296 -> 66961408
bad block 4620288 -> 66945024
bad block 5783552 -> 66928640
bad block 5931008 -> 66912256
bad block 6520832 -> 66895872
bad block 6619136 -> 66879488
bad block 8896512 -> 66863104
bad block 9060352 -> 66846720
bad block 9191424 -> 66830336
bad block 11255808 -> 66813952
bad block 12763136 -> 66797568
bad block 13467648 -> 66781184
bad block 13533184 -> 66764800
checking done!
server waiting.....
connected!!!
^C


[cdf]read---
50	2	0.002247
60	1	0.003371
70	1	0.004494
120	13	0.019101
130	126	0.160674
140	188	0.371910
150	88	0.470787
160	46	0.522472
170	25	0.550562
180	26	0.579775
190	10	0.591011
200	5	0.596629
210	5	0.602247
220	5	0.607865
230	10	0.619101
240	5	0.624719
260	2	0.626966
270	1	0.628090
280	100	0.740449
290	150	0.908989
300	26	0.938202
310	2	0.940449
320	1	0.941573
330	6	0.948315
340	7	0.956180
350	1	0.957303
370	5	0.962921
380	9	0.973034
8480	1	0.974157
8860	1	0.975281
8950	1	0.976404
9000	1	0.977528
9460	1	0.978652
9770	1	0.979775
9780	1	0.980899
10010	1	0.982022
10100	1	0.983146
10450	1	0.984270
10510	1	0.985393
10670	1	0.986517
10710	1	0.987640
10870	1	0.988764
10950	1	0.989888
11040	1	0.991011
11850	1	0.992135
11890	1	0.993258
11970	1	0.994382
12000	1	0.995506
12020	1	0.996629
12680	1	0.997753
14560	1	0.998876
14720	1	1.000000
a_type	l_type	max	min	avg	cnt	percentage
0	0	63	0	9.593	27	3.03371%
1	0	11897	121	195.110	715	80.33707%
2	0	14725	275	1552.023	171	19.21348%
--------------------------------------------
|            bench type:                   |
--------------------------------------------
----algorithm----
[0~100(usec)]: 0
[100~200(usec)]: 0
[200~300(usec)]: 0
[300~400(usec)]: 0
[400~500(usec)]: 0
[500~600(usec)]: 0
[600~700(usec)]: 0
[700~800(usec)]: 0
[800~900(usec)]: 0
[900~1000(usec)]: 0
[over_ms]: 0
[over__s]: 0
----lower----
[0~100(usec)]: 0
[100~200(usec)]: 0
[200~300(usec)]: 0
[300~400(usec)]: 0
[400~500(usec)]: 0
[500~600(usec)]: 0
[600~700(usec)]: 0
[700~800(usec)]: 0
[800~900(usec)]: 0
[900~1000(usec)]: 0
[over_ms]: 0
[over__s]: 0
----average----
[avg_algo]: 0.0
[avg_low]: 0.0
-----lower_info----
[write_op]: 0
[read_op]: 0
[trim_op]:0
[WAF, RAF]: 0.000000, 0.000000
[if rw test]: 0.000000(WAF), 0.000000(RAF)
[all write Time]:0.0
[all read Time]:0.0

----summary----
[all_time]: 0.0
[size]: 60650.531250(mb)
[FAIL NUM] 0
[SUCCESS RATIO] 1.000000
[throughput] inf(kb/s)
             inf(mb/s)
[cache hit cnt,ratio] 0, 0.000000
[cache hit cnt,ratio dftl] 0, 0.000000
[READ WRITE CNT] 890 7762355
error cnt:109
result of ms:
---
bye bye!
# of gc: 0
# of translation page gc: 0
# of data page gc: 0
# of translation page gc w/ data page gc: 0
# of translation page gc w/ read op: 0
# of evict: 2626
# of buf hit: 4
!!! print info !!!
BH: buffer hit, H: hit, R: read, MC: memcpy, CE: clean eviction, DE: dirty eviction, GC: garbage collection
a_type--->>> 0: BH, 1: H
2: R & MC, 3: R & CE & MC
4: R & DE & MC, 5: R & CE & GC & MC
6: R & DE & GC & MC
!!! print info !!!
Cache hit on read: 0
Cache miss on read: 0
Cache hit on write: 6905825
Cache miss on write: 3103

Clean hit on read: 163
Dirty hit on read: 552
Clean hit on write: 35
Dirty hit on write: 6905790

% of miss : 0.00
# Clean eviction: 0
# Dirty eviction: 2626

Clean eviciton on read: 0
Dirty eviction on read: 0
Clean eviction on write: 0
Dirty eviction on write: 2626

Dirty eviction ratio: 100.00%
Dirty eviction ratio on read: nan%
Dirty eviction ratio on write: 100.00%

WAF: 3.96

0 0
1 215
2 2626
3 0
4 0
5 886
6 6908928
7 0
8 0
bdbm_mt max: 0
nohost: Wait for all the on-going jobs to finish...
nohost: [dm_nohost_close] MAP Download from HW!
nohost: [dm_nohost_close] closed!
write_q_hit:441527	read_q_hit:0	retry_hit:0